<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
    <string>Downloads the current release version of Suspicious Package</string>
  <key>Identifier</key>
    <string>com.github.weasels.download.suspiciouspackage</string>
  <key>Input</key>
    <dict>
      <key>NAME</key>
        <string>Suspicious Package</string>
    </dict>
  <key>MinimumVersion</key>
    <string>2.0.0</string>
  <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
          <dict>
            <key>url</key>
              <string>http://www.mothersruin.com/software/SuspiciousPackage/download.html</string>
            <key>filename</key>
              <string>%NAME%.pkg</string>
          </dict>
        <key>Processor</key>
          <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
    </array>
</dict>
</plist>
