<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
    <string>Downloads latest Suspicious Package package and imports into Munki.</string>
  <key>Identifier</key>
    <string>com.github.autopkg.munki.suspiciouspackage</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
      <string>SuspiciousPackage</string>
    <key>MUNKI_REPO_SUBDIR</key>
      <string>utilities</string>
    <key>pkginfo</key>
    <dict>
      <key>blocking_applications</key>
       <array>
       </array>
      <key>catalogs</key>
       <array>
         <string>testing</string>
       </array>
      <key>description</key>
        <string>What's in that OS X installer package? With Suspicious Package, you can find out quickly and safely from the Finder.</string>
      <key>display_name</key>
        <string>%NAME%</string>
      <key>minimum_os_version</key>
        <string>10.6.0</string>
      <key>name</key>
        <string>%NAME%</string>
      <key>unattended_install</key>
        <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
    <string>2.0.0</string>
  <key>ParentRecipe</key>
    <string>com.github.weasels.download.suspiciouspackage</string>
  <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
          <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
            <string>%pathname%</string>
          <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
          <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
